app/views/likes/new.html.erb

                <% if like.sender_user == current_user.id %>
                    <% @liked_users.push(like.receiver_user) %>
---
INSERT INTO "likes" ("sender_user", "receiver_user", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_user", 1], ["receiver_user", 2], ["created_at", "2020-06-05 19:14:12.687436"], ["updated_at", "2020-06-05 19:14:12.687436"]]