app/controllers/citas_controller.rb

  def new
    @cita = Cita.new
    @locals = Local.all
    if params.permit(:create)[:create] == 'false'
      @matched_user = params.permit(:matched_user)[:matched_user]
      @citas = Cita.all
    else
      cita_params = params.permit(:sender_id, :receiver_id, :local_id, :fecha, :hora, :accepted)
      @cita = Cita.create(cita_params)
---
SELECT "locals".* FROM "locals"
INSERT INTO "cita" ("sender_id", "receiver_id", "fecha", "hora", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["sender_id", 4], ["receiver_id", 1], ["fecha", "2020-06-30"], ["hora", "14:30:00"], ["created_at", "2020-06-22 19:22:48.575520"], ["updated_at", "2020-06-22 19:22:48.575520"]]

  def show
    @citas = Cita.all
---
SELECT "cita".* FROM "cita"

  def update
    if params.permit(:delete)[:delete] == 'true'
      @cita = Cita.find(params[:cita_id])
      @cita.destroy
    else
      cita_params = params.permit(:accepted)
      @cita = Cita.find(params[:cita_id])
      if @cita.update(cita_params)
---
SELECT  "cita".* FROM "cita" WHERE "cita"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "cita" WHERE "cita"."id" = $1  [["id", 1]]
SELECT  "cita".* FROM "cita" WHERE "cita"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cita" SET "accepted" = $1, "updated_at" = $2 WHERE "cita"."id" = $3  [["accepted", true], ["updated_at", "2020-06-24 00:07:00.191849"], ["id", 2]]