app/controllers/dueno_users_controller.rb

SELECT "dueno_users".* FROM "dueno_users"
SELECT "locals".* FROM "locals" WHERE "locals"."dueno_user_id" IN ($1, $2)  [["dueno_user_id", 1], ["dueno_user_id", 2]]
---
  def index
    @dueno_users = DuenoUser.all.includes(:locals)