app/controllers/likes_controller.rb

  def new
    @users = User.all
    @likes = Like.all
---
SELECT "users".* FROM "users"
SELECT "likes".* FROM "likes"

  def create
    like_params = params.permit(:sender_user, :receiver_user, :match)
    @like = Like.create(like_params)

    if @like.save
      @likes = Like.all
---
INSERT INTO "likes" ("sender_user", "receiver_user", "match", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_user", 3], ["receiver_user", 2], ["match", false], ["created_at", "2020-06-05 22:57:04.317972"], ["updated_at", "2020-06-05 22:57:04.317972"]]
INSERT INTO "likes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-06-05 16:09:15.809421"], ["updated_at", "2020-06-05 16:09:15.809421"]]
SELECT "likes".* FROM "likes"

  def update
    like_params = params.permit(:match)
    @like = Like.find(params[:id])
    if @like.update(like_params)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "likes" SET "match" = $1, "updated_at" = $2 WHERE "likes"."id" = $3  [["match", true], ["updated_at", "2020-06-05 19:25:15.424120"], ["id", 5]]