app/controllers/locals_controller.rb

  def index
    @locals = Local.all
---
SELECT "locals".* FROM "locals"

  def show
    @local = Local.find(params[:id])
---
SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    local_params = params.require(:local).permit(:nombre, :direccion, :tipo, :dueno_user_id, :avatar)
    local_params['dueno_user_id'] = current_dueno_user.id

    @local = Local.create(local_params)
    if @local.save
---
INSERT INTO "locals" ("nombre", "direccion", "tipo", "dueno_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "sdfasdfasdf"], ["direccion", "asdfasdfasdf"], ["tipo", 0], ["dueno_user_id", 2], ["created_at", "2020-06-24 01:42:57.256752"], ["updated_at", "2020-06-24 01:42:57.256752"]]
UPDATE "locals" SET "updated_at" = $1 WHERE "locals"."id" = $2  [["updated_at", "2020-06-24 01:43:57.057289"], ["id", 2]]

  def edit
    @local = Local.find(params[:id])
---
SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @local = Local.find(params[:id])
    @local.destroy
---
SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "locals" WHERE "locals"."id" = $1  [["id", 2]]