app/controllers/show_match_controller.rb

SELECT "likes".* FROM "likes"
SELECT "users".* FROM "users"
---
  def My_match
    @likes = Like.all
    @users = User.all