app/views/citas/new.html.erb

SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                <tr>
                    <td>Local: <%= @locals.find(@existing_cita.local_id).nombre %></td>

SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                    <%if @locals.find(@existing_cita.local_id).avatar.attached? %>
                        <td><%= cl_image_tag(@locals.find(@existing_cita.local_id).avatar.key, width: 200, height: 250, crop: :scale)%></td>

SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                <tr>
                    <td>Local: <%= @locals.find(@invited_to_cita[0].local_id).nombre %></td>