app/views/citas/new.html.erb

SELECT  "locals".* FROM "locals" WHERE "locals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
            <tr>
                <td>Local: <%= @locals.find(@invited_to_cita[0].local_id).nombre %></td>