app/views/citas/show.html.erb

SELECT "locals".* FROM "locals" WHERE "locals"."id" = $1  [["id", 3]]
---
                        <tr>
                            <td>Local: <%= @locals.where(id: date.local_id)[0].nombre%></td>

SELECT "locals".* FROM "locals" WHERE "locals"."id" = $1  [["id", 3]]
---
                            <tr>
                                <td>Local: <%= @locals.where(id: date.local_id)[0].nombre%></td>